meander-son/led/frdmmcxn947_hello_world_cm33_core0_-demo/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT1_8 (coord A1), P1_8/J9[32]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_UART_RX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_9 (coord B1), P1_9/J9[30]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_UART_TX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_2 (coord B16), P0_2/SWO/J23[6]/D16[4]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_SWD_SWO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_SWD_SWO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_SWD_SWO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_29 (coord F8), SW_3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW_3_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW_3_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW_3_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW_3_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW_3_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW_3_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_16 (coord J15), SW_2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW_2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW_2_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW_2_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW_2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW_2_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW_2_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_20 (coord M17), SW_4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW_4_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW_4_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW_4_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW_4_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW_4_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW_4_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT4_13 (coord T7), SW_1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW_1_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW_1_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW_1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW_1_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW_1_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW_1_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void OLEDI2C(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
